[
  {
    "name": "standard",
    "description": "Analyzer par défaut, basé sur Unicode Text Segmentation."
  },
  {
    "name": "simple",
    "description": "Divise le texte en tokens à partir des caractères non-lettres, met en minuscules."
  },
  {
    "name": "whitespace",
    "description": "Divise uniquement sur les espaces blancs, ne change pas la casse."
  },
  {
    "name": "stop",
    "description": "Comme standard mais supprime les stopwords (anglais par défaut)."
  },
  {
    "name": "keyword",
    "description": "Ne divise pas le texte, retourne le texte entier comme un seul token."
  },
  {
    "name": "pattern",
    "description": "Utilise une regex pour diviser le texte. Nécessite le paramètre 'pattern'."
  },
  {
    "name": "fingerprint",
    "description": "Trie les tokens, supprime les doublons et les met en forme normalisée."
  },
  {
    "name": "arabic",
    "description": "Analyseur pour l'arabe, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "armenian",
    "description": "Analyseur pour l'arménien, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "basque",
    "description": "Analyseur pour le basque, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "bengali",
    "description": "Analyseur pour le bengali, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "brazilian",
    "description": "Analyseur pour le portugais brésilien, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "bulgarian",
    "description": "Analyseur pour le bulgare, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "catalan",
    "description": "Analyseur pour le catalan, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "cjk",
    "description": "Analyseur pour les langues CJK, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "czech",
    "description": "Analyseur pour le tchèque, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "danish",
    "description": "Analyseur pour le danois, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "dutch",
    "description": "Analyseur pour le néerlandais, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "english",
    "description": "Analyseur pour l'anglais, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "estonian",
    "description": "Analyseur pour l'estonien, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "finnish",
    "description": "Analyseur pour le finnois, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "french",
    "description": "Analyseur pour le français, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "galician",
    "description": "Analyseur pour le galicien, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "german",
    "description": "Analyseur pour l'allemand, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "greek",
    "description": "Analyseur pour le grec, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "hindi",
    "description": "Analyseur pour l'hindi, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "hungarian",
    "description": "Analyseur pour le hongrois, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "indonesian",
    "description": "Analyseur pour l'indonésien, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "irish",
    "description": "Analyseur pour l'irlandais, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "italian",
    "description": "Analyseur pour l'italien, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "latvian",
    "description": "Analyseur pour le letton, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "lithuanian",
    "description": "Analyseur pour le lituanien, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "norwegian",
    "description": "Analyseur pour le norvégien, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "persian",
    "description": "Analyseur pour le persan, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "portuguese",
    "description": "Analyseur pour le portugais, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "romanian",
    "description": "Analyseur pour le roumain, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "russian",
    "description": "Analyseur pour le russe, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "serbian",
    "description": "Analyseur pour le serbe, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "sorani",
    "description": "Analyseur pour le sorani, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "spanish",
    "description": "Analyseur pour l'espagnol, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "swedish",
    "description": "Analyseur pour le suédois, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "thai",
    "description": "Analyseur pour le thaï, basé sur le segmentateur de texte Unicode."
  },
  {
    "name": "turkish",
    "description": "Analyseur pour le turc, basé sur le segmentateur de texte Unicode."
  }
]
